OpenPuya/PY32F040_Firmware/Drivers/PY32F4xx_HAL_Driver/Src/py32f4xx_hal_esmc.c
  assert_param(IS_ESMC_DDR_MODE(cmd->DdrMode));

  /* Process locked */
  __HAL_LOCK(hesmc);

  if(hesmc->State == HAL_ESMC_STATE_READY)
  {
    hesmc->ErrorCode = HAL_ESMC_ERROR_NONE;

    /* Update ESMC state */
    hesmc->State = HAL_ESMC_STATE_BUSY;

    /* Wait till idle state set */
    status = ESMC_WaitFlagStateUntilTimeout(hesmc, ESMC_FLAG_IDLE, SET, tickstart, hesmc->Timeout);

    if (status == HAL_OK)
    {
      if ((cmd->InstructionMode != ESMC_INSTRUCTION_NONE) && \
          (cmd->AddressMode == ESMC_ADDRESS_NONE) && \
          (cmd->AlternateByte == ESMC_ALTERNATE_BYTES_DISABLE)&& \
          (cmd->DataMode == ESMC_DATA_NONE))
      {
        /* Clear idle interrupt */
        __HAL_ESMC_CLEAR_FLAG(hesmc, ESMC_FLAG_IDLEIF);

        /* Call the configuration function  */
        ESMC_Config(hesmc, cmd, ESMC_FUNCTIONAL_MODE_INDIRECT_INSTRUCT);

        /* Process unlocked */
        __HAL_UNLOCK(hesmc);

        /* Enable the ESMC idle Interrupt */
        __HAL_ESMC_ENABLE_GLOBAL_IT(hesmc);
        __HAL_ESMC_ENABLE_IT(hesmc, ESMC_IT_IDLE);
      }
      else
      {
        /* Call the configuration function  */
        ESMC_Config(hesmc, cmd, ESMC_FUNCTIONAL_MODE_INDIRECT_READ_WRITE);

        if (cmd->DataMode == ESMC_DATA_NONE)
        {
          /* Process unlocked */
          __HAL_UNLOCK(hesmc);

          /* Enable the ESMC datawait Interrupt */
          __HAL_ESMC_ENABLE_GLOBAL_IT(hesmc);
          __HAL_ESMC_ENABLE_IT(hesmc, ESMC_IT_DATAWAIT);
        } else
        {
          /* Update ESMC state */
          hesmc->State = HAL_ESMC_STATE_READY;

          /* Process unlocked */
          __HAL_UNLOCK(hesmc);
        }
      }
    }
  }
  else
  {
    status = HAL_BUSY;

    /* Process unlocked */
    __HAL_UNLOCK(hesmc);
  }

  /* Return function status */
  return status;
}

/**
  * @brief  Configure the Memory Mapped mode.
  * @param  hesmc : ESMC handle
  * @param  cmd : structure that contains the command configuration information.
  * @note   This function is used only in Memory mapped Mode
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_ESMC_MemoryMapped(ESMC_HandleTypeDef *hesmc, ESMC_CommandTypeDef *cmd)
{
  HAL_StatusTypeDef status;
  uint32_t tickstart = HAL_GetTick();

  /* Check the parameters */
  assert_param(IS_ESMC_INSTRUCTION_MODE(cmd->InstructionMode));
  if (cmd->InstructionMode != ESMC_INSTRUCTION_NONE)
  {
    assert_param(IS_ESMC_INSTRUCTION(cmd->Instruction));
  }

  assert_param(IS_ESMC_ADDRESS_MODE(cmd->AddressMode));
  if (cmd->AddressMode != ESMC_ADDRESS_NONE)
  {
    assert_param(IS_ESMC_ADDRESS_SIZE(cmd->AddressSize));
  }

  assert_param(IS_ESMC_ALTERNATE_BYTES_MODE(cmd->AlternateByteMode));
  if (cmd->AlternateByteMode != ESMC_ALTERNATE_BYTES_DISABLE)
  {
    assert_param(IS_ESMC_ALTERNATE_BYTE(cmd->AlternateByte));
  }

  assert_param(IS_ESMC_DUMMY_CYCLES(cmd->DummyCycles));
  assert_param(IS_ESMC_DATA_MODE(cmd->DataMode));

  assert_param(IS_ESMC_DDR_MODE(cmd->DdrMode));

  /* Process locked */
  __HAL_LOCK(hesmc);

  if(hesmc->State == HAL_ESMC_STATE_READY)
  {
    hesmc->ErrorCode = HAL_ESMC_ERROR_NONE;

    /* Update state */
    hesmc->State = HAL_ESMC_STATE_BUSY_MEM_MAPPED;

    /* Wait till IDLE flag set */
    status = ESMC_WaitFlagStateUntilTimeout(hesmc, ESMC_FLAG_IDLE, SET, tickstart, hesmc->Timeout);

    if (status == HAL_OK)
    {
      /* Disable XIP mode, DMA, global interrupt */
      CLEAR_BIT(hesmc->Instance->CR, (ESMC_CR_XIPEN | ESMC_CR_DMAEN | ESMC_CR_GIE));

      /* Call the configuration function */
      ESMC_Config(hesmc, cmd, ESMC_FUNCTIONAL_MODE_MEMORY_MAPPED);

      /* Enable XIP mode */
      SET_BIT(hesmc->Instance->CR, ESMC_CR_XIPEN);

      /* Enable the slave select */
      __HAL_ESMC_ENABLE_SLAVE(hesmc);
    }
  }
  else
  {
    status = HAL_BUSY;
  }

  /* Process unlocked */
  __HAL_UNLOCK(hesmc);

  /* Return function status */
  return status;
}

/**
  * @brief Transmit an amount of data in blocking mode.
  * @param hesmc ESMC handle
  * @param pData pointer to data buffer
  * @param Timeout  Time out duration
  * @note   This function is used only in Indirect Write Mode
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_ESMC_Transmit(ESMC_HandleTypeDef *hesmc, uint8_t *pData, uint32_t Timeout)
{
  HAL_StatusTypeDef status = HAL_OK;
  uint32_t tickstart = HAL_GetTick();
  uint8_t first_data_flag = 1;

  /* Process locked */
  __HAL_LOCK(hesmc);

  if(hesmc->State == HAL_ESMC_STATE_READY)
  {
    hesmc->ErrorCode = HAL_ESMC_ERROR_NONE;

    if((pData != NULL) && (hesmc->TxXferCount != 0) && (hesmc->TxXferSize != 0))
    {
      /* Update state */
      hesmc->State = HAL_ESMC_STATE_BUSY_INDIRECT_TX;

      hesmc->pTxBuffPtr = pData;

      while(hesmc->TxXferCount != 0U)
      {
        if ((hesmc->TxXferCount/HAL_ESMC_FIFO_SIZE) > 0)
        {
          ESMC_WriteBuff(hesmc, hesmc->pTxBuffPtr, HAL_ESMC_FIFO_SIZE);
          hesmc->pTxBuffPtr += HAL_ESMC_FIFO_SIZE;
          hesmc->TxXferCount -= HAL_ESMC_FIFO_SIZE;
        } else
        {
          ESMC_WriteBuff(hesmc, hesmc->pTxBuffPtr, hesmc->TxXferCount);
          hesmc->pTxBuffPtr += hesmc->TxXferCount;
          hesmc->TxXferCount = 0;
        }

        if (first_data_flag == 1)
        {
          first_data_flag = 0;
          /* send command */
          hesmc->Instance->ADDR24 = hesmc->ContexAddr24;
        }

        /* Wait until fifo empty flag is set */
        status = ESMC_WaitFlagStateUntilTimeout(hesmc, ESMC_FLAG_FIFOEIF, SET, tickstart, Timeout);
        if (status != HAL_OK)
        {
          break;
        }
      }

      if (status == HAL_OK)
      {
        if (hesmc->Contex == ESMC_CONTEXT_WRITE_FIXED_LENGTH)
        {
          /* Wait until IDLE flag is set */
          status = ESMC_WaitFlagStateUntilTimeout(hesmc, ESMC_FLAG_IDLEIF, SET, tickstart, Timeout);
          if (status == HAL_OK)
          {
            /* Clear flag */
            __HAL_ESMC_CLEAR_FLAG(hesmc, ESMC_FLAG_IDLEIF);
          }
        } else
        {
          /* Wait until DATAWAIT flag is set */
          status = ESMC_WaitFlagStateUntilTimeout(hesmc, ESMC_FLAG_DATAWAITIF, SET, tickstart, Timeout);
          if (status == HAL_OK)
          {
            /* Disable the slave select */
            __HAL_ESMC_DISABLE_SLAVE(hesmc);
          }
        }
      }

      /* Update ESMC state */
      hesmc->State = HAL_ESMC_STATE_READY;
    }
    else
    {
      hesmc->ErrorCode |= HAL_ESMC_ERROR_INVALID_PARAM;
      status = HAL_ERROR;
    }
  }
  else
  {
    status = HAL_BUSY;
  }

