OpenPuya/PY32F040_Firmware/Drivers/PY32F4xx_HAL_Driver/Src/py32f4xx_hal_esmc.c
  /* Process unlocked */
  __HAL_UNLOCK(hesmc);

  return status;
}

/**
  * @brief Receive an amount of data in blocking mode
  * @param hesmc ESMC handle
  * @param pData pointer to data buffer
  * @param Timeout  Time out duration
  * @note   This function is used only in Indirect Read Mode
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_ESMC_Receive(ESMC_HandleTypeDef *hesmc, uint8_t *pData, uint32_t Timeout)
{
  HAL_StatusTypeDef status = HAL_OK;
  uint32_t tickstart = HAL_GetTick();

  /* Process locked */
  __HAL_LOCK(hesmc);

  if(hesmc->State == HAL_ESMC_STATE_READY)
  {
    hesmc->ErrorCode = HAL_ESMC_ERROR_NONE;

    if((pData != NULL) && (hesmc->RxXferCount != 0) && (hesmc->RxXferSize != 0))
    {
      /* Update state */
      hesmc->State = HAL_ESMC_STATE_BUSY_INDIRECT_RX;

      hesmc->pRxBuffPtr = pData;

      /* send command */
      hesmc->Instance->ADDR24 = hesmc->ContexAddr24;

      while ((hesmc->RxXferCount/HAL_ESMC_FIFO_SIZE) > 0U)
      {
        /* Wait until fifo full flag is set */
        if (ESMC_WaitFlagStateUntilTimeout(hesmc, ESMC_FLAG_FIFOFIF, SET, tickstart, Timeout) != HAL_OK)
        {
          break;
        }
        ESMC_ReadBuff(hesmc, hesmc->pRxBuffPtr, HAL_ESMC_FIFO_SIZE);
        hesmc->pRxBuffPtr += HAL_ESMC_FIFO_SIZE;
        hesmc->RxXferCount -= HAL_ESMC_FIFO_SIZE;
      }
      while (hesmc->RxXferCount != 0)
      {
        if (hesmc->Contex == ESMC_CONTEXT_READ_FIXED_LENGTH)
        {
          /* Wait until idle flag is set */
          if (ESMC_WaitFlagStateUntilTimeout(hesmc, ESMC_FLAG_IDLEIF, SET, tickstart, Timeout) != HAL_OK)
          {
            break;
          }
        } else if (hesmc->Contex == ESMC_CONTEXT_READ_VARIABLE_LENGTH)
        {
          if (hesmc->RxXferCount <= (HAL_ESMC_FIFO_SIZE/2))
          {
            /* Wait until fifo half full flag is set */
            if (ESMC_WaitFlagStateUntilTimeout(hesmc, ESMC_FLAG_FIFOHIF, SET, tickstart, Timeout) != HAL_OK)
            {
              break;
            }
          } else
          {
            /* Wait until fifo full flag is set */
            if (ESMC_WaitFlagStateUntilTimeout(hesmc, ESMC_FLAG_FIFOFIF, SET, tickstart, Timeout) != HAL_OK)
            {
              break;
            }
          }
        }
        ESMC_ReadBuff(hesmc, hesmc->pRxBuffPtr, hesmc->RxXferCount);
        hesmc->pRxBuffPtr += hesmc->RxXferCount;
        hesmc->RxXferCount = 0;
      }

      if (status == HAL_OK)
      {
        if (hesmc->Contex == ESMC_CONTEXT_READ_VARIABLE_LENGTH)
        {
          /* Disable the slave select */
          __HAL_ESMC_DISABLE_SLAVE(hesmc);
        }
      }

      /* Update ESMC state */
      hesmc->State = HAL_ESMC_STATE_READY;
    }
    else
    {
      hesmc->ErrorCode |= HAL_ESMC_ERROR_INVALID_PARAM;
      status = HAL_ERROR;
    }
  }
  else
  {
    status = HAL_BUSY;
  }

  /* Process unlocked */
  __HAL_UNLOCK(hesmc);

  return status;
}


/**
  * @brief  Send an amount of data in interrupt mode
  * @param  hesmc ESMC handle
  * @param  pData pointer to data buffer
  * @note   This function is used only in Indirect Write Mode
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_ESMC_Transmit_IT(ESMC_HandleTypeDef *hesmc, uint8_t *pData)
{
  HAL_StatusTypeDef status = HAL_OK;

  /* Process locked */
  __HAL_LOCK(hesmc);

  if(hesmc->State == HAL_ESMC_STATE_READY)
  {
    hesmc->ErrorCode = HAL_ESMC_ERROR_NONE;

    if((pData != NULL) && (hesmc->TxXferCount != 0) && (hesmc->TxXferSize != 0))
    {
      /* Update state */
      hesmc->State = HAL_ESMC_STATE_BUSY_INDIRECT_TX;

      hesmc->pTxBuffPtr = pData;

      if ((hesmc->TxXferCount/HAL_ESMC_FIFO_SIZE) > 0)
      {
        ESMC_WriteBuff(hesmc, hesmc->pTxBuffPtr, HAL_ESMC_FIFO_SIZE);
        hesmc->pTxBuffPtr += HAL_ESMC_FIFO_SIZE;
        hesmc->TxXferCount -= HAL_ESMC_FIFO_SIZE;
      } else
      {
        ESMC_WriteBuff(hesmc, hesmc->pTxBuffPtr, hesmc->TxXferCount);
        hesmc->pTxBuffPtr += hesmc->TxXferCount;
        hesmc->TxXferCount = 0;
      }

      /* send command */
      hesmc->Instance->ADDR24 = hesmc->ContexAddr24;

      /* Process unlocked */
      __HAL_UNLOCK(hesmc);

      /* Enable the ESMC Interrupt */
      __HAL_ESMC_ENABLE_GLOBAL_IT(hesmc);
      if (hesmc->Contex == ESMC_CONTEXT_WRITE_FIXED_LENGTH)
      {
        __HAL_ESMC_ENABLE_IT(hesmc, (ESMC_IT_DATAWAIT | ESMC_IT_IDLE));
      } else
      {
        __HAL_ESMC_ENABLE_IT(hesmc, ESMC_IT_DATAWAIT);
      }
    }
    else
    {
      hesmc->ErrorCode |= HAL_ESMC_ERROR_INVALID_PARAM;
      status = HAL_ERROR;

      /* Process unlocked */
      __HAL_UNLOCK(hesmc);
    }
  }
  else
  {
    status = HAL_BUSY;

    /* Process unlocked */
    __HAL_UNLOCK(hesmc);
  }

  return status;
}

/**
  * @brief  Receive an amount of data in no-blocking mode with Interrupt
  * @param  hesmc ESMC handle
  * @param  pData pointer to data buffer
  * @note   This function is used only in Indirect Read Mode
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_ESMC_Receive_IT(ESMC_HandleTypeDef *hesmc, uint8_t *pData)
{
  HAL_StatusTypeDef status = HAL_OK;

  /* Process locked */
  __HAL_LOCK(hesmc);

  if(hesmc->State == HAL_ESMC_STATE_READY)
  {
    hesmc->ErrorCode = HAL_ESMC_ERROR_NONE;

    if((pData != NULL) && (hesmc->RxXferCount != 0) && (hesmc->RxXferSize != 0))
    {
      /* Update state */
      hesmc->State = HAL_ESMC_STATE_BUSY_INDIRECT_RX;

      hesmc->pRxBuffPtr = pData;

      /* send command */
      hesmc->Instance->ADDR24 = hesmc->ContexAddr24;

      /* Process unlocked */
      __HAL_UNLOCK(hesmc);

      /* Enable the ESMC Interrupt */
      __HAL_ESMC_ENABLE_GLOBAL_IT(hesmc);
      if (hesmc->Contex == ESMC_CONTEXT_READ_FIXED_LENGTH)
      {
        __HAL_ESMC_ENABLE_IT(hesmc, (ESMC_IT_DATAWAIT | ESMC_IT_IDLE));
      } else
      {
        __HAL_ESMC_ENABLE_IT(hesmc, ESMC_IT_DATAWAIT);
      }
    }
    else
    {
      hesmc->ErrorCode |= HAL_ESMC_ERROR_INVALID_PARAM;
      status = HAL_ERROR;

