OpenPuya/PY32F040_Firmware/Drivers/PY32F4xx_HAL_Driver/Src/py32f4xx_hal_esmc.c
      WRITE_REG(hesmc->Instance->TCR, 0);

      /* Restore default values */
      hesmc->Contex = ESMC_CONTEXT_NONE;
    }

    /* write register */
    WRITE_REG(hesmc->Instance->ADDR32, TmpADDR32);
    /* Disable the slave select by default */
    __HAL_ESMC_DISABLE_SLAVE(hesmc);

    /* clear fifo */
    __HAL_ESMC_CLEAR_FIFO(hesmc);

    WRITE_REG(hesmc->Instance->SOCR, TmpSOCR);
    WRITE_REG(hesmc->Instance->DCR, TmpDCR);

    /* set command value and address value  */
    if (cmd->DataMode != ESMC_DATA_NONE)
    {
      hesmc->ContexAddr24 = TmpADDR24;
    } else
    {
      WRITE_REG(hesmc->Instance->ADDR24, TmpADDR24);
    }

  } else if (FunctionalMode == ESMC_FUNCTIONAL_MODE_MEMORY_MAPPED)
  {
    TmpSOCR = hesmc->Instance->XSOCR;
    TmpDCR  = hesmc->Instance->XDCR;
    TmpADDR32 = hesmc->Instance->ADDR32;

    /* configure slave select output */
    MODIFY_REG(TmpADDR32, ESMC_ADDR32_XSS, (cmd->CSPinSel) << ESMC_ADDR32_XSS_Pos);

    /* config transmit format */
    MODIFY_REG(TmpSOCR, ESMC_SOCR_SPIMODE, cmd->TransferFormat);

    /* config command region */
    if (cmd->InstructionMode != ESMC_INSTRUCTION_NONE)
    {
      WRITE_REG(hesmc->Instance->XSFCR, cmd->Instruction);

      CLEAR_BIT(TmpDCR, ESMC_DCR_NOCMD);

      if (cmd->InstructionMode  == ESMC_INSTRUCTION_MULTI_LINES)
      {
        SET_BIT(TmpSOCR, ESMC_SOCR_MULTICMD);
      } else
      {
        CLEAR_BIT(TmpSOCR, ESMC_SOCR_MULTICMD);
      }
    } else
    {
      /* Omit instruction and begin with Address */
      SET_BIT(TmpDCR, ESMC_DCR_NOCMD);
    }

    /* config address region */
    CLEAR_BIT(TmpDCR, ESMC_DCR_NOADDR);
    if ((cmd->AddressMode == ESMC_ADDRESS_MULTI_LINES) || \
        (cmd->InstructionMode  == ESMC_INSTRUCTION_MULTI_LINES))
    {
      SET_BIT(TmpSOCR, ESMC_SOCR_MULTIADDR);
    } else
    {
      CLEAR_BIT(TmpSOCR, ESMC_SOCR_MULTIADDR);
    }

    /* set address size */
    MODIFY_REG(hesmc->Instance->XCR3, (ESMC_CR3_ADDR8BIT | ESMC_CR3_ADDR16BIT | ESMC_CR3_ADDR32BIT), cmd->AddressSize);

    /* config alternate region */
    if (cmd->AlternateByteMode == ESMC_ALTERNATE_BYTES_ENABLE)
    {
      /* configure alternate byte */
      MODIFY_REG(TmpADDR32, ESMC_ADDR32_MREG, cmd->AlternateByte);
      SET_BIT(TmpSOCR, ESMC_SOCR_SENM);
    } else
    {
      CLEAR_BIT(TmpSOCR, ESMC_SOCR_SENM);
    }

    /* config dummy region */
    MODIFY_REG(TmpDCR, ESMC_DCR_DUMMY, cmd->DummyCycles);

    /* config data region */
    /* set read mode */
    SET_BIT(TmpDCR, ESMC_DCR_REC);

    /* write register */
    WRITE_REG(hesmc->Instance->ADDR32, TmpADDR32);

    /* Disable the slave select by default */
    __HAL_ESMC_DISABLE_SLAVE(hesmc);

    /* clear fifo */
    __HAL_ESMC_CLEAR_FIFO(hesmc);

    /* write register */
    WRITE_REG(hesmc->Instance->XSOCR, TmpSOCR);
    WRITE_REG(hesmc->Instance->XDCR, TmpDCR);
  }
}

/**
  * @brief  Write data to FIFO.
  * @param  hesmc ESMC handle
  * @param  pData Data buffer pointer
  * @param  dataLen Number of bytes to be written
  * @retval None
  */
void ESMC_WriteBuff(ESMC_HandleTypeDef *hesmc, uint8_t *pData, uint8_t dataLen)
{
  uint8_t len32 = (dataLen & 0xFC) >> 2;
  uint8_t len8 = dataLen & 0x03;
  uint8_t i;
  uint32_t data;
  __IO uint8_t *data_reg8 = (uint8_t *)(&hesmc->Instance->DATA);

  for(i=0; i<len32; i++)
  {
    data = (uint32_t)(*pData++);
    data |= ((uint32_t)(*pData++) << 8);
    data |= ((uint32_t)(*pData++) << 16);
    data |= ((uint32_t)(*pData++) << 24);
    hesmc->Instance->DATA = data;
  }

  for(i=0; i<len8; i++)
  {
    *data_reg8 = *pData++;
  }
}

/**
  * @brief  Write data to FIFO.
  * @param  hesmc ESMC handle
  * @param  pData Data buffer pointer
  * @param  dataLen Number of bytes to be written
  * @retval None
  */
void ESMC_ReadBuff(ESMC_HandleTypeDef *hesmc, uint8_t *pData, uint8_t dataLen)
{
  uint8_t len32 = (dataLen & 0xFC) >> 2;
  uint8_t len8 = dataLen & 0x03;
  uint8_t i;
  uint32_t data;

  for(i=0; i<len32; i++)
  {
    data = hesmc->Instance->DATA;
    *pData++ = (uint8_t)(data & 0xFFU);
    *pData++ = (uint8_t)((data >> 8U) & 0xFFU);
    *pData++ = (uint8_t)((data >> 16U) & 0xFFU);
    *pData++ = (uint8_t)((data >> 24U) & 0xFFU);
  }

  if (len8 != 0)
  {
    data = hesmc->Instance->DATA;
    while (len8--)
    {
      *pData++ = (uint8_t)(data & 0xFFU);
      data >>= 8;
    }
  }
}
/**
  * @}
  */

#endif /* HAL_ESMC_MODULE_ENABLED */
/**
  * @}
  */

/**
  * @}
  */

/************************ (C) COPYRIGHT Puya *****END OF FILE******************/
